# Ввод: любое натуральное число
# Программа должна найти корень введённого числа с таким условием:
# 1. Запрещено использовать любую операцию извлечения из под корня (возведение в степень 0.5 и тому подобное)
# 2. Запрещено выносить 1 в отдельный случай (if num == 1 -> return 1). Делайте так, чтобы алгоритм работал сразу же
# 3. Искомый корень должен быть целым числом. То есть, при вводе 81 или 49 мы должны получить 9 или 7, соответственно. Если мы получаем 80 или 48, то выводим на экран "Слишком сложно, не могу" или подобное ему сообщение.
